// Cities >=100,000 inhabitants, source estimates for 2025. See CITY_SOURCES.md.
export const cities=[
  {
    "name": "Абакан",
    "region": "Хакасия"
  },
  {
    "name": "Альметьевск",
    "region": "Татарстан"
  },
  {
    "name": "Ангарск",
    "region": "Иркутская область"
  },
  {
    "name": "Арзамас",
    "region": "Нижегородская область"
  },
  {
    "name": "Армавир",
    "region": "Краснодарский край"
  },
  {
    "name": "Артём",
    "region": "Приморский край"
  },
  {
    "name": "Архангельск",
    "region": "Архангельская область"
  },
  {
    "name": "Астрахань",
    "region": "Астраханская область"
  },
  {
    "name": "Балаково",
    "region": "Саратовская область"
  },
  {
    "name": "Балашиха",
    "region": "Московская область"
  },
  {
    "name": "Барнаул",
    "region": "Алтайский край"
  },
  {
    "name": "Батайск",
    "region": "Ростовская область"
  },
  {
    "name": "Белгород",
    "region": "Белгородская область"
  },
  {
    "name": "Бердск",
    "region": "Новосибирская область"
  },
  {
    "name": "Березники",
    "region": "Пермский край"
  },
  {
    "name": "Бийск",
    "region": "Алтайский край"
  },
  {
    "name": "Благовещенск",
    "region": "Амурская область"
  },
  {
    "name": "Братск",
    "region": "Иркутская область"
  },
  {
    "name": "Брянск",
    "region": "Брянская область"
  },
  {
    "name": "Великий Новгород",
    "region": "Новгородская область"
  },
  {
    "name": "Видное",
    "region": "Московская область"
  },
  {
    "name": "Владивосток",
    "region": "Приморский край"
  },
  {
    "name": "Владикавказ",
    "region": "Северная Осетия — Алания"
  },
  {
    "name": "Владимир",
    "region": "Владимирская область"
  },
  {
    "name": "Волгоград",
    "region": "Волгоградская область"
  },
  {
    "name": "Волгодонск",
    "region": "Ростовская область"
  },
  {
    "name": "Волжский",
    "region": "Волгоградская область"
  },
  {
    "name": "Вологда",
    "region": "Вологодская область"
  },
  {
    "name": "Воронеж",
    "region": "Воронежская область"
  },
  {
    "name": "Грозный",
    "region": "Чечня"
  },
  {
    "name": "Дербент",
    "region": "Дагестан"
  },
  {
    "name": "Дзержинск",
    "region": "Нижегородская область"
  },
  {
    "name": "Димитровград",
    "region": "Ульяновская область"
  },
  {
    "name": "Долгопрудный",
    "region": "Московская область"
  },
  {
    "name": "Домодедово",
    "region": "Московская область"
  },
  {
    "name": "Евпатория",
    "region": "Крым"
  },
  {
    "name": "Екатеринбург",
    "region": "Свердловская область"
  },
  {
    "name": "Ессентуки",
    "region": "Ставропольский край"
  },
  {
    "name": "Жуковский",
    "region": "Московская область"
  },
  {
    "name": "Златоуст",
    "region": "Челябинская область"
  },
  {
    "name": "Иваново",
    "region": "Ивановская область"
  },
  {
    "name": "Ижевск",
    "region": "Удмуртия"
  },
  {
    "name": "Иркутск",
    "region": "Иркутская область"
  },
  {
    "name": "Йошкар-Ола",
    "region": "Марий Эл"
  },
  {
    "name": "Казань",
    "region": "Татарстан"
  },
  {
    "name": "Калининград",
    "region": "Калининградская область"
  },
  {
    "name": "Калуга",
    "region": "Калужская область"
  },
  {
    "name": "Каменск-Уральский",
    "region": "Свердловская область"
  },
  {
    "name": "Камышин",
    "region": "Волгоградская область"
  },
  {
    "name": "Каспийск",
    "region": "Дагестан"
  },
  {
    "name": "Кемерово",
    "region": "Кемеровская область"
  },
  {
    "name": "Керчь",
    "region": "Крым"
  },
  {
    "name": "Киров",
    "region": "Кировская область"
  },
  {
    "name": "Кисловодск",
    "region": "Ставропольский край"
  },
  {
    "name": "Ковров",
    "region": "Владимирская область"
  },
  {
    "name": "Коломна",
    "region": "Московская область"
  },
  {
    "name": "Комсомольск-на-Амуре",
    "region": "Хабаровский край"
  },
  {
    "name": "Копейск",
    "region": "Челябинская область"
  },
  {
    "name": "Королёв",
    "region": "Московская область"
  },
  {
    "name": "Кострома",
    "region": "Костромская область"
  },
  {
    "name": "Красногорск",
    "region": "Московская область"
  },
  {
    "name": "Краснодар",
    "region": "Краснодарский край"
  },
  {
    "name": "Красноярск",
    "region": "Красноярский край"
  },
  {
    "name": "Курган",
    "region": "Курганская область"
  },
  {
    "name": "Курск",
    "region": "Курская область"
  },
  {
    "name": "Кызыл",
    "region": "Тыва"
  },
  {
    "name": "Липецк",
    "region": "Липецкая область"
  },
  {
    "name": "Люберцы",
    "region": "Московская область"
  },
  {
    "name": "Магнитогорск",
    "region": "Челябинская область"
  },
  {
    "name": "Майкоп",
    "region": "Адыгея"
  },
  {
    "name": "Махачкала",
    "region": "Дагестан"
  },
  {
    "name": "Миасс",
    "region": "Челябинская область"
  },
  {
    "name": "Михайловск",
    "region": "Ставропольский край"
  },
  {
    "name": "Москва",
    "region": "Москва"
  },
  {
    "name": "Мурино",
    "region": "Ленинградская область"
  },
  {
    "name": "Мурманск",
    "region": "Мурманская область"
  },
  {
    "name": "Муром",
    "region": "Владимирская область"
  },
  {
    "name": "Мытищи",
    "region": "Московская область"
  },
  {
    "name": "Набережные Челны",
    "region": "Татарстан"
  },
  {
    "name": "Назрань",
    "region": "Ингушетия"
  },
  {
    "name": "Нальчик",
    "region": "Кабардино-Балкария"
  },
  {
    "name": "Находка",
    "region": "Приморский край"
  },
  {
    "name": "Невинномысск",
    "region": "Ставропольский край"
  },
  {
    "name": "Нефтекамск",
    "region": "Башкортостан"
  },
  {
    "name": "Нефтеюганск",
    "region": "Ханты-Мансийский АО — Югра"
  },
  {
    "name": "Нижневартовск",
    "region": "Ханты-Мансийский АО — Югра"
  },
  {
    "name": "Нижнекамск",
    "region": "Татарстан"
  },
  {
    "name": "Нижний Новгород",
    "region": "Нижегородская область"
  },
  {
    "name": "Нижний Тагил",
    "region": "Свердловская область"
  },
  {
    "name": "Новокузнецк",
    "region": "Кемеровская область"
  },
  {
    "name": "Новомосковск",
    "region": "Тульская область"
  },
  {
    "name": "Новороссийск",
    "region": "Краснодарский край"
  },
  {
    "name": "Новосибирск",
    "region": "Новосибирская область"
  },
  {
    "name": "Новочебоксарск",
    "region": "Чувашия"
  },
  {
    "name": "Новочеркасск",
    "region": "Ростовская область"
  },
  {
    "name": "Новошахтинск",
    "region": "Ростовская область"
  },
  {
    "name": "Новый Уренгой",
    "region": "Ямало-Ненецкий АО"
  },
  {
    "name": "Ногинск",
    "region": "Московская область"
  },
  {
    "name": "Норильск",
    "region": "Красноярский край"
  },
  {
    "name": "Ноябрьск",
    "region": "Ямало-Ненецкий АО"
  },
  {
    "name": "Обнинск",
    "region": "Калужская область"
  },
  {
    "name": "Одинцово",
    "region": "Московская область"
  },
  {
    "name": "Октябрьский",
    "region": "Башкортостан"
  },
  {
    "name": "Омск",
    "region": "Омская область"
  },
  {
    "name": "Орёл",
    "region": "Орловская область"
  },
  {
    "name": "Оренбург",
    "region": "Оренбургская область"
  },
  {
    "name": "Орехово-Зуево",
    "region": "Московская область"
  },
  {
    "name": "Орск",
    "region": "Оренбургская область"
  },
  {
    "name": "Пенза",
    "region": "Пензенская область"
  },
  {
    "name": "Первоуральск",
    "region": "Свердловская область"
  },
  {
    "name": "Пермь",
    "region": "Пермский край"
  },
  {
    "name": "Петрозаводск",
    "region": "Карелия"
  },
  {
    "name": "Петропавловск-Камчатский",
    "region": "Камчатский край"
  },
  {
    "name": "Подольск",
    "region": "Московская область"
  },
  {
    "name": "Прокопьевск",
    "region": "Кемеровская область"
  },
  {
    "name": "Псков",
    "region": "Псковская область"
  },
  {
    "name": "Пушкино",
    "region": "Московская область"
  },
  {
    "name": "Пятигорск",
    "region": "Ставропольский край"
  },
  {
    "name": "Раменское",
    "region": "Московская область"
  },
  {
    "name": "Реутов",
    "region": "Московская область"
  },
  {
    "name": "Ростов-на-Дону",
    "region": "Ростовская область"
  },
  {
    "name": "Рубцовск",
    "region": "Алтайский край"
  },
  {
    "name": "Рыбинск",
    "region": "Ярославская область"
  },
  {
    "name": "Рязань",
    "region": "Рязанская область"
  },
  {
    "name": "Салават",
    "region": "Башкортостан"
  },
  {
    "name": "Самара",
    "region": "Самарская область"
  },
  {
    "name": "Санкт-Петербург",
    "region": "Санкт-Петербург"
  },
  {
    "name": "Саранск",
    "region": "Мордовия"
  },
  {
    "name": "Саратов",
    "region": "Саратовская область"
  },
  {
    "name": "Севастополь",
    "region": "Севастополь"
  },
  {
    "name": "Северодвинск",
    "region": "Архангельская область"
  },
  {
    "name": "Северск",
    "region": "Томская область"
  },
  {
    "name": "Серпухов",
    "region": "Московская область"
  },
  {
    "name": "Симферополь",
    "region": "Крым"
  },
  {
    "name": "Смоленск",
    "region": "Смоленская область"
  },
  {
    "name": "Сочи",
    "region": "Краснодарский край"
  },
  {
    "name": "Ставрополь",
    "region": "Ставропольский край"
  },
  {
    "name": "Старый Оскол",
    "region": "Белгородская область"
  },
  {
    "name": "Стерлитамак",
    "region": "Башкортостан"
  },
  {
    "name": "Сургут",
    "region": "Ханты-Мансийский АО — Югра"
  },
  {
    "name": "Сызрань",
    "region": "Самарская область"
  },
  {
    "name": "Сыктывкар",
    "region": "Коми"
  },
  {
    "name": "Таганрог",
    "region": "Ростовская область"
  },
  {
    "name": "Тамбов",
    "region": "Тамбовская область"
  },
  {
    "name": "Тверь",
    "region": "Тверская область"
  },
  {
    "name": "Тольятти",
    "region": "Самарская область"
  },
  {
    "name": "Томск",
    "region": "Томская область"
  },
  {
    "name": "Тула",
    "region": "Тульская область"
  },
  {
    "name": "Тюмень",
    "region": "Тюменская область"
  },
  {
    "name": "Улан-Удэ",
    "region": "Бурятия"
  },
  {
    "name": "Ульяновск",
    "region": "Ульяновская область"
  },
  {
    "name": "Уссурийск",
    "region": "Приморский край"
  },
  {
    "name": "Уфа",
    "region": "Башкортостан"
  },
  {
    "name": "Хабаровск",
    "region": "Хабаровский край"
  },
  {
    "name": "Ханты-Мансийск",
    "region": "Ханты-Мансийский АО — Югра"
  },
  {
    "name": "Хасавюрт",
    "region": "Дагестан"
  },
  {
    "name": "Химки",
    "region": "Московская область"
  },
  {
    "name": "Чебоксары",
    "region": "Чувашия"
  },
  {
    "name": "Челябинск",
    "region": "Челябинская область"
  },
  {
    "name": "Череповец",
    "region": "Вологодская область"
  },
  {
    "name": "Черкесск",
    "region": "Карачаево-Черкесия"
  },
  {
    "name": "Чита",
    "region": "Забайкальский край"
  },
  {
    "name": "Шахты",
    "region": "Ростовская область"
  },
  {
    "name": "Щёлково",
    "region": "Московская область"
  },
  {
    "name": "Электросталь",
    "region": "Московская область"
  },
  {
    "name": "Элиста",
    "region": "Калмыкия"
  },
  {
    "name": "Энгельс",
    "region": "Саратовская область"
  },
  {
    "name": "Южно-Сахалинск",
    "region": "Сахалинская область"
  },
  {
    "name": "Якутск",
    "region": "Саха (Якутия)"
  },
  {
    "name": "Ярославль",
    "region": "Ярославская область"
  }
];
export const cityRegions=Object.fromEntries(cities.map(c=>[c.name,c.region]));
